---
kind: property
id: P:Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetZ
source: html/5bae121e-96b0-8c54-6419-8f6252aba6d5.htm
---
# Autodesk.Revit.DB.Visual.Marble.TextureRealWorldOffsetZ Property

The property labeled "Offset Z" from the "Marble" schema.

## Syntax (C#)
```csharp
public static string TextureRealWorldOffsetZ { get; }
```

## Remarks
This property is of type "AssetPropertyDistance".